Revit 2026 API

# BuiltInFailuresSplitToposolidFailures Class

---

SystemObject Autodesk.Revit.DBBuiltInFailuresSplitToposolidFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SplitToposolidFailures
```
```vb
Public NotInheritable Class SplitToposolidFailures
```
```cpp
public ref class SplitToposolidFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SplitToposolidFailures = class end
```

The BuiltInFailuresSplitToposolidFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GenerateNewSplitTopoFailed | Failed to generate new toposolid after split. |
|  | SplitToposolidFailed | Split toposolid failed. |

#### Reference

Autodesk.Revit.DB Namespace